In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")

In [2]:
df = pd.read_csv("testdata.csv")
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
df.shape

(418, 11)

In [4]:
df1 = df.drop(columns=["PassengerId","Name","Ticket","Cabin"])

In [5]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
df1

     Pclass     Sex   Age  SibSp  Parch      Fare Embarked
0         3    male  34.5      0      0    7.8292        Q
1         3  female  47.0      1      0    7.0000        S
2         2    male  62.0      0      0    9.6875        Q
3         3    male  27.0      0      0    8.6625        S
4         3  female  22.0      1      1   12.2875        S
..      ...     ...   ...    ...    ...       ...      ...
413       3    male   NaN      0      0    8.0500        S
414       1  female  39.0      0      0  108.9000        C
415       3    male  38.5      0      0    7.2500        S
416       3    male   NaN      0      0    8.0500        S
417       3    male   NaN      1      1   22.3583        C

[418 rows x 7 columns]

In [7]:
df.shape

(418, 11)

In [8]:
df1.shape

(418, 7)

In [9]:
df1[df1["Age"]<1] =1
df1["Age"].astype(float)

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413     NaN
414    39.0
415    38.5
416     NaN
417     NaN
Name: Age, Length: 418, dtype: float64

In [10]:
# df.drop_duplicates(inplace = True,ignore_index = True)

In [11]:
df1.duplicated().sum()

42

In [12]:
df1["Age"].mean()

30.278614457831324

In [13]:
df1["Age"].fillna(30.27,inplace  = True)
#df_train["Age"] = df_train["Age"].interpolate(method="linear")
#df1["Age"] = df1["Age"].interpolate(method = "linear")

In [14]:
df1["Embarked"].fillna("S",inplace = True)

In [15]:
df1.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        1
Embarked    0
dtype: int64

In [16]:
df1["Fare"].value_counts()

Fare
7.7500     21
26.0000    19
8.0500     17
13.0000    17
7.8958     11
           ..
8.5167      1
78.8500     1
52.0000     1
10.7083     1
22.3583     1
Name: count, Length: 167, dtype: int64

In [17]:
df1["Fare"].mean()

35.433303597122304

In [18]:
df1["Fare"].fillna(35.43,inplace = True)

In [19]:
# df1.dropna(inplace  = True)

In [20]:
df1[df1["Sex"] == 1]

     Pclass Sex  Age  SibSp  Parch  Fare Embarked
201       1   1  1.0      1      1   1.0        1
250       1   1  1.0      1      1   1.0        1
281       1   1  1.0      1      1   1.0        1
307       1   1  1.0      1      1   1.0        1
354       1   1  1.0      1      1   1.0        1

In [21]:
df1["Sex"].replace({1:"male"},inplace  = True)
#df1.drop(index = [201,250,281,307,354],inplace = True)

In [22]:
df1["Embarked"].replace({1:"S"},inplace = True)

In [23]:
df1.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [24]:
df1[df1["Sex"] == 1]

Empty DataFrame
Columns: [Pclass, Sex, Age, SibSp, Parch, Fare, Embarked]
Index: []

In [25]:
df1["Sex"].unique()

array(['male', 'female'], dtype=object)

In [26]:
df1['Sex'].astype(str)

0        male
1      female
2        male
3        male
4      female
        ...
413      male
414    female
415      male
416      male
417      male
Name: Sex, Length: 418, dtype: object

In [27]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df1["Sex_le"] = le.fit_transform(df1["Sex"])
df1.head(15)

    Pclass     Sex    Age  SibSp  Parch     Fare Embarked  Sex_le
0        3    male  34.50      0      0   7.8292        Q       1
1        3  female  47.00      1      0   7.0000        S       0
2        2    male  62.00      0      0   9.6875        Q       1
3        3    male  27.00      0      0   8.6625        S       1
4        3  female  22.00      1      1  12.2875        S       0
5        3    male  14.00      0      0   9.2250        S       1
6        3  female  30.00      0      0   7.6292        Q       0
7        2    male  26.00      1      1  29.0000        S       1
8        3  female  18.00      0      0   7.2292        C       0
9        3    male  21.00      2      0  24.1500        S       1
10       3    male  30.27      0      0   7.8958        S       1
11       1    male  46.00      0      0  26.0000        S       1
12       1  female  23.00      1      0  82.2667        S       0
13       2    male  63.00      1      0  26.0000        S       1
14       1  female  47.00      1      0  61.1750        S       0

In [28]:
df1["Embarked"].unique()

array(['Q', 'S', 'C'], dtype=object)

In [29]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

df1["Embarked_le"] = le.fit_transform(df1["Embarked"])
df1.head(10)

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Sex_le  Embarked_le
0       3    male  34.5      0      0   7.8292        Q       1            1
1       3  female  47.0      1      0   7.0000        S       0            2
2       2    male  62.0      0      0   9.6875        Q       1            1
3       3    male  27.0      0      0   8.6625        S       1            2
4       3  female  22.0      1      1  12.2875        S       0            2
5       3    male  14.0      0      0   9.2250        S       1            2
6       3  female  30.0      0      0   7.6292        Q       0            1
7       2    male  26.0      1      1  29.0000        S       1            2
8       3  female  18.0      0      0   7.2292        C       0            0
9       3    male  21.0      2      0  24.1500        S       1            2

In [30]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [31]:
df1["min_max_Fair"] = ( df["Fare"] - df1["Fare"].min())/(df1["Fare"].max() - df1["Fare"].min())

In [32]:
df1 = df1.drop(columns = ["Sex","Embarked"])

In [33]:
# df.to_csv("titanic_final_testcleaned.csv",index = False)

In [34]:
import joblib
#model = joblib.load("svm_model.joblib")

In [35]:
#model = joblib.load("cleaned_u_svm.joblib")

In [36]:
df1.shape

(418, 8)

In [37]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [38]:
df1.isnull().sum()

Pclass          0
Age             0
SibSp           0
Parch           0
Fare            0
Sex_le          0
Embarked_le     0
min_max_Fair    1
dtype: int64

In [39]:
#df1["Fare"].mean()

In [40]:
#df1["Fare"].fillna(35.43,inplace = True)

In [41]:
df1.columns

Index(['Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Sex_le', 'Embarked_le',
       'min_max_Fair'],
      dtype='object')

# only for the decision tree

In [51]:
df1.columns

Index(['Pclass', 'Age', 'SibSp', 'Parch', 'Sex_le', 'Embarked_le',
       'min_max_Fair'],
      dtype='object')

In [52]:
df1["min_max_Fair"].fillna(0.0695,inplace = True)

In [44]:
df1 = df1.drop(columns = ["Fare"])

In [53]:
import joblib
model = joblib.load("'TITANIC1ANN.joblib")
prediction = model.predict(df1)

In [54]:
ypred  = pd.DataFrame({"PassengerId":df["PassengerId"],"Survived":prediction})

In [ ]:
#df.drop(index = [201,250,281,307,354],inplace = True)

In [55]:
ypred.to_csv("Answers(1)TITANIC.csv",index= False)